app/controllers/likes_controller.rb

  def create
    @likeable.liked_by current_user
    @likeable.create_activity(:like, owner: current_user)
---
INSERT INTO "activities" ("created_at", "key", "owner_id", "owner_type", "parameters", "trackable_id", "trackable_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)