app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "content_html", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "asdf"], ["content_html", "<p>asdf</p>"], ["created_at", "2016-06-18 23:37:19.655579"], ["updated_at", "2016-06-18 23:37:19.655579"], ["user_id", 1]]
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
---
  def set_post
    @post = Post.find(params[:id])