app/controllers/users_controller.rb

UPDATE "users" SET "about" = ?, "avatar" = ?, "dob" = ?, "location" = ?, "phone_number" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["about", "Computer Science Major "], ["avatar", "20160205_160304.jpg"], ["dob", "2016-07-05"], ["location", "RI"], ["phone_number", ""], ["updated_at", "2016-06-06 04:03:09.269727"]]
---
  def update
    if @user.update(user_params)